#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ
&НаКлиенте
Функция  ПолучитьТекущуюСтроку()
	Возврат Элементы.Товары.ТекущиеДанные;
КонецФункции
#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	НаКлиенте.РассчитатьСумму(ПолучитьТекущуюСтроку());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	НаКлиенте.РассчитатьСумму(ПолучитьТекущуюСтроку());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	НаКлиенте.РассчитатьЦену(ПолучитьТекущуюСтроку());
КонецПроцедуры
#КонецОбласти