//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаКлиенте
Функция  ПолучитьТекущуюСтроку()
	Возврат Элементы.Товары.ТекущиеДанные;
КонецФункции

//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ
//

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	НаКлиенте.РассчитатьСумму(ПолучитьТекущуюСтроку());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	НаКлиенте.РассчитатьСумму(ПолучитьТекущуюСтроку());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	НаКлиенте.РассчитатьЦену(ПолучитьТекущуюСтроку());
КонецПроцедуры
