
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ПартииНоменклатуры.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПриходнаяНакладнаяТовары.Количество) КАК Количество,
	|	СУММА(ПриходнаяНакладнаяТовары.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|ГДЕ
	|	ПриходнаяНакладнаяТовары.Номенклатура.Вид = ЗНАЧЕНИЕ(Перечисление.ВидНоменклатуры.Товар)
	|	И ПриходнаяНакладнаяТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		
		Движение = Движения.ПартииНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Партия = Ссылка;
		Движение.Количество = Выборка.Количество;
		Движение.Стоимость = Выборка.Сумма;
	КонецЦикла;
КонецПроцедуры
